TELEGRAM_CHANNELS = 'https://t.me/llredii'

CHECKPOINT_ONE = 5  # в минутах для получения вознаграждения

CHECKPOINT_TWO = 1  # в часах для получения вознаграждения

PAYMENT_ONE = 10  # кол-во балов за комментарий

PAYMENT_TWO = 3  # кол-во балов за комментарий

PAYMENT_THREE = 1  # кол-во балов за комментарий

DATE_RANGE = 1  # Кол-во месяцев за которые учитывается подсчет баллов

CHECK_EVERY = 5  # Пауза между проверками, в минутах

CHECK_TIME = 120

API_ID = 19445993  # API ID От живого аккаунта

API_HASH = '9d214ad962ca34c0d938d4d5f4dc1c7a'  # Хэш от живого аккаунта

############# Настройки бота #############

START_MESSAGE = '👋 Добро пожаловать в нашу телеграм группу!\n' \
                'Здесь вы найдете самые крутые и редкие скины от игры CS:GO! 🎮💣\n\n' \
                '🛒 Мы предлагаем широкий ассортимент скинов, которые помогут вам стать настоящим стильным ' \
                'профессионалом в игре. В нашем магазине вы найдете скины разных редкостей, ' \
                'от обычных до ножей высочайшей редкости! 💎💼'

ADMIN = ['1422194909', '934464608']  # ID администратора для бота

TOKEN = "5833626895:AAHC5phRwNi2kaTXgqEJ0wTqtnp4-O8VLlk"  # Токен от бота

LOGO = f'src/telegram/media/LOGO.jpg'

ADMIN_IMG = r'src/telegram/media/admin.jpg'
